#include "MG32x02z__Common_DRV.h"
#include "MG32x02z_URT_DRV.h"
#include "MG32x02z_GPIO_DRV.h"
#include "usart.h"
#include "prsm3.h"

//----------------------------------------------------------------------------------------
// Обработчик прерывания USART по приему
//----------------------------------------------------------------------------------------
void URT_Rx_Callback(void) {
	
	PRSM3_AddNewByte();
	usUsart = 1;
}

//----------------------------------------------------------------------------------------
// Функция записывает 1 байт в USART
//----------------------------------------------------------------------------------------
void URT_Write(uint8_t c) {
	
	while(URT_IsTxReady() == TxBusy);
	URT_SetTXData(URT0, 1, c);
		;
}

//----------------------------------------------------------------------------------------
// Функция записывает слово (4 байта) в USART
//----------------------------------------------------------------------------------------
void URT_WriteWord(uint32_t w) {
	while(!URT0->STA.MBIT.TXF);
	URT_SetTXData(URT0, 4, w);
		;
}

//----------------------------------------------------------------------------------------
// Функция записывает строку в USART
//----------------------------------------------------------------------------------------
void URT_Print(const char* sz) {
	
	while (*sz)
		URT_Write(*sz++);
	while(URT_IsTxEndTransmission() == TxBusy);
}

//----------------------------------------------------------------------------------------
// Проверка флага TXF (готовность передачи USART)
//----------------------------------------------------------------------------------------
URT_Status URT_IsTxReady() {
	return URT0->STA.MBIT.TXF;
}

//----------------------------------------------------------------------------------------
// Проверка флага TCF (окончание передачи USART)
//----------------------------------------------------------------------------------------
URT_Status URT_IsTxEndTransmission() {
	return URT0->STA.MBIT.TCF;
}

