#include "wdt.h"

//----------------------------------------------------------------------------------------
// Конфигурация WDT как источника горячего сброса
//----------------------------------------------------------------------------------------
void WDT_Config()
{
	UnProtectModuleReg(RSTprotect); // разблокировать изменения в регистрах RST
    RST_CRstSource_Config(RST_IWDT_WE, ENABLE);
    ProtectModuleReg(RSTprotect); // заблокировать изменения в регистрах RST
}

//----------------------------------------------------------------------------------------
// Функция запускает WDT, время от ~7 мс до ~32 секунд
//----------------------------------------------------------------------------------------
void wdt_enable(IWDT_DIVS_TypeDef divider)
{
    UnProtectModuleReg(IWDTprotect); // разблокировать изменения в регистрах IWDT
    IWDT_Divider_Select(divider); // изменить предделитель IWDT                             
    IWDT_Cmd(ENABLE); // запустить IWDT                                            
    ProtectModuleReg(IWDTprotect); // разблокировать изменения в регистрах IWDT
}
//----------------------------------------------------------------------------------------
// Функция перезапускает сторожевой таймер
//----------------------------------------------------------------------------------------
void wdt_reset(void)
{
    IWDT_RefreshCounter();                    
}

//----------------------------------------------------------------------------------------
// Функция отключает WDT
//----------------------------------------------------------------------------------------
void wdt_disable(void)
{
    UnProtectModuleReg(IWDTprotect); // разблокировать изменения в регистрах IWDT
    IWDT_Cmd(DISABLE); // остановить IWDT       
    ProtectModuleReg(IWDTprotect); // разблокировать изменения в регистрах IWDT
}



